In [1]:
# Import our dependencies
import pandas as pd
import numpy as np

In [2]:
# Import our input dataset
econ_df = pd.read_csv('../Resources/economy.csv.zip', low_memory=False)
econ_df.shape

(43234, 99)

In [3]:
picks_df = pd.read_csv('../Resources/picks.csv.zip')
picks_df.shape

(16035, 17)

In [4]:
players_df = pd.read_csv('../Resources/players.csv.zip')
players_df.shape

(383317, 101)

In [5]:
results_df = pd.read_csv('../Resources/results.csv.zip')
results_df.shape

(45773, 19)

**economy**

In [6]:
econ_df.head(3)

,date,match_id,event_id,team_1,team_2,best_of,_map,t1_start,t2_start,1_t1,...,21_winner,22_winner,23_winner,24_winner,25_winner,26_winner,27_winner,28_winner,29_winner,30_winner
0,2020-03-01,2339402,4901,G2,Natus Vincere,5,Nuke,t,ct,4350.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2020-03-01,2339402,4901,G2,Natus Vincere,5,Dust2,ct,t,3900.0,...,2.0,1.0,1.0,1.0,1.0,1.0,2.0,2.0,2.0,NaN
2,2020-03-01,2339402,4901,G2,Natus Vincere,5,Mirage,t,ct,4150.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
econ_df.columns.values

array(['date', 'match_id', 'event_id', 'team_1', 'team_2', 'best_of',
       '_map', 't1_start', 't2_start', '1_t1', '2_t1', '3_t1', '4_t1',
       '5_t1', '6_t1', '7_t1', '8_t1', '9_t1', '10_t1', '11_t1', '12_t1',
       '13_t1', '14_t1', '15_t1', '16_t1', '17_t1', '18_t1', '19_t1',
       '20_t1', '21_t1', '22_t1', '23_t1', '24_t1', '25_t1', '26_t1',
       '27_t1', '28_t1', '29_t1', '30_t1', '1_t2', '2_t2', '3_t2', '4_t2',
       '5_t2', '6_t2', '7_t2', '8_t2', '9_t2', '10_t2', '11_t2', '12_t2',
       '13_t2', '14_t2', '15_t2', '16_t2', '17_t2', '18_t2', '19_t2',
       '20_t2', '21_t2', '22_t2', '23_t2', '24_t2', '25_t2', '26_t2',
       '27_t2', '28_t2', '29_t2', '30_t2', '1_winner', '2_winner',
       '3_winner', '4_winner', '5_winner', '6_winner', '7_winner',
       '8_winner', '9_winner', '10_winner', '11_winner', '12_winner',
       '13_winner', '14_winner', '15_winner', '16_winner', '17_winner',
       '18_winner', '19_winner', '20_winner', '21_winner', '22_winner',
       '23_winner', '24_winner', '25_winner', '26_winner', '27_winner',
       '28_winner', '29_winner', '30_winner'], dtype=object)

In [35]:
econ_df['1_t1'].value_counts()

4300.0     7978
4250.0     6457
4200.0     5922
4350.0     3722
4150.0     3478
           ...
2350.0        1
5350.0        1
18850.0       1
1500.0        1
6650.0        1
Name: 1_t1, Length: 103, dtype: int64

In [34]:
econ_df[['1_t2', '2_t2', '10_t2', '20_t2', '29_t2', '30_t2']].describe()

,1_t2,2_t2,10_t2,20_t2,29_t2,30_t2
count,43234.000000,43234.000000,43234.000000,39701.000000,11623.000000,7899.000000
mean,4157.717306,12459.631309,22550.455660,21546.547946,23380.598813,24454.874035
std,349.046721,7079.419147,8707.857659,8316.381583,7566.749431,6101.657098
min,0.000000,0.000000,0.000000,0.000000,0.000000,6100.000000
25%,4100.000000,6550.000000,20900.000000,19450.000000,21000.000000,20900.000000
50%,4250.000000,14450.000000,25500.000000,24300.000000,25500.000000,25700.000000
75%,4300.000000,19100.000000,28150.000000,26950.000000,28150.000000,28500.000000
max,18250.000000,33000.000000,41650.000000,40750.000000,47450.000000,51900.000000

**picks**

In [8]:
picks_df.head(3)

,date,team_1,team_2,inverted_teams,match_id,event_id,best_of,system,t1_removed_1,t1_removed_2,t1_removed_3,t2_removed_1,t2_removed_2,t2_removed_3,t1_picked_1,t2_picked_1,left_over
0,2020-03-18,TeamOne,Recon 5,1,2340454,5151,3,123412,Vertigo,Train,0.0,Nuke,Overpass,0.0,Dust2,Inferno,Mirage
1,2020-03-18,Rugratz,Bad News Bears,0,2340453,5151,3,123412,Dust2,Nuke,0.0,Mirage,Train,0.0,Vertigo,Inferno,Overpass
2,2020-03-18,New England Whalers,Station7,0,2340461,5243,1,121212,Mirage,Dust2,Vertigo,Nuke,Train,Overpass,0.0,0.0,Inferno

In [20]:
picks_df['best_of'].value_counts()

3            10142
1             5656
2              224
3.               3
of               3
3(LAN)           3
1(Online)        2
2(Online)        1
3(Online)        1
Name: best_of, dtype: int64

**players**

In [9]:
players_df.head(3)

,date,player_name,team,opponent,country,player_id,match_id,event_id,event_name,best_of,...,m3_kddiff_ct,m3_adr_ct,m3_kast_ct,m3_rating_ct,m3_kills_t,m3_deaths_t,m3_kddiff_t,m3_adr_t,m3_kast_t,m3_rating_t
0,2020-02-26,Brehze,Evil Geniuses,Liquid,United States,9136,2339385,4901,IEM Katowice 2020,3,...,-1.0,72.5,80.0,0.93,7.0,9.0,-2.0,70.4,63.6,0.89
1,2020-02-26,CeRq,Evil Geniuses,Liquid,Bulgaria,11219,2339385,4901,IEM Katowice 2020,3,...,3.0,79.5,53.3,1.12,4.0,8.0,-4.0,40.7,54.5,0.53
2,2020-02-26,EliGE,Liquid,Evil Geniuses,United States,8738,2339385,4901,IEM Katowice 2020,3,...,1.0,81.5,63.6,1.03,9.0,9.0,0.0,87.9,73.3,1.05

In [10]:
players_df['team'].value_counts()

Virtus.pro      3460
Liquid          3373
Cloud9          3265
mousesports     3229
G2              3142
                ...
Fictitious         4
SuperstarS         4
Malta              4
Saudi Arabia       4
Pakistan           3
Name: team, Length: 4155, dtype: int64

In [11]:
players_df['event_id'].value_counts()

2124    2580
3469    2200
3687    2150
3047    2130
3546    2009
        ...
5081      10
2484      10
5024      10
3340       9
2297       8
Name: event_id, Length: 3158, dtype: int64

In [12]:
players_df.columns.values

array(['date', 'player_name', 'team', 'opponent', 'country', 'player_id',
       'match_id', 'event_id', 'event_name', 'best_of', 'map_1', 'map_2',
       'map_3', 'kills', 'assists', 'deaths', 'hs', 'flash_assists',
       'kast', 'kddiff', 'adr', 'fkdiff', 'rating', 'm1_kills',
       'm1_assists', 'm1_deaths', 'm1_hs', 'm1_flash_assists', 'm1_kast',
       'm1_kddiff', 'm1_adr', 'm1_fkdiff', 'm1_rating', 'm2_kills',
       'm2_assists', 'm2_deaths', 'm2_hs', 'm2_flash_assists', 'm2_kast',
       'm2_kddiff', 'm2_adr', 'm2_fkdiff', 'm2_rating', 'm3_kills',
       'm3_assists', 'm3_deaths', 'm3_hs', 'm3_flash_assists', 'm3_kast',
       'm3_kddiff', 'm3_adr', 'm3_fkdiff', 'm3_rating', 'kills_ct',
       'deaths_ct', 'kddiff_ct', 'adr_ct', 'kast_ct', 'rating_ct',
       'kills_t', 'deaths_t', 'kddiff_t', 'adr_t', 'kast_t', 'rating_t',
       'm1_kills_ct', 'm1_deaths_ct', 'm1_kddiff_ct', 'm1_adr_ct',
       'm1_kast_ct', 'm1_rating_ct', 'm1_kills_t', 'm1_deaths_t',
       'm1_kddiff_t', 'm1_adr_t', 'm1_kast_t', 'm1_rating_t',
       'm2_kills_ct', 'm2_deaths_ct', 'm2_kddiff_ct', 'm2_adr_ct',
       'm2_kast_ct', 'm2_rating_ct', 'm2_kills_t', 'm2_deaths_t',
       'm2_kddiff_t', 'm2_adr_t', 'm2_kast_t', 'm2_rating_t',
       'm3_kills_ct', 'm3_deaths_ct', 'm3_kddiff_ct', 'm3_adr_ct',
       'm3_kast_ct', 'm3_rating_ct', 'm3_kills_t', 'm3_deaths_t',
       'm3_kddiff_t', 'm3_adr_t', 'm3_kast_t', 'm3_rating_t'],
      dtype=object)

**results**

In [13]:
results_df.head(3)

,date,team_1,team_2,_map,result_1,result_2,map_winner,starting_ct,ct_1,t_2,t_1,ct_2,event_id,match_id,rank_1,rank_2,map_wins_1,map_wins_2,match_winner
0,2020-03-18,Recon 5,TeamOne,Dust2,0,16,2,2,0,1,0,15,5151,2340454,62,63,0,2,2
1,2020-03-18,Recon 5,TeamOne,Inferno,13,16,2,2,8,6,5,10,5151,2340454,62,63,0,2,2
2,2020-03-18,New England Whalers,Station7,Inferno,12,16,2,1,9,6,3,10,5243,2340461,140,118,12,16,2

In [27]:
results_df[results_df.result_1 > results_df.result_2].result_1.values

array([16, 16, 16, ..., 16, 16, 16], dtype=int64)

In [28]:
results_df[results_df.result_1 > results_df.result_2].result_1.value_counts()

16    22477
19     1454
22      456
25      144
28       35
21       17
31       10
34        4
10        3
4         2
26        1
6         1
Name: result_1, dtype: int64

In [14]:
results_df._map.nunique()

10

In [21]:
results_df['map_winner'].value_counts()

1    24604
2    21169
Name: map_winner, dtype: int64

In [15]:
results_df['_map'].value_counts()

Mirage         9021
Inferno        7485
Train          6566
Overpass       5625
Cache          4613
Nuke           4206
Dust2          4114
Cobblestone    3513
Vertigo         609
Default          21
Name: _map, dtype: int64

In [22]:
## CS_GO Win_Loss Predicting
df = results_df.iloc[:, [1, 2, 3, 14, 15, 6]]
sel = (df.team_1 == 'Natus Vincere') | (df.team_2 == 'Natus Vincere') | \
        (df.team_1 == 'fnatic') | (df.team_2 == 'fnatic')
csgo_df = df[sel]
csgo_df.head()

           team_1 team_2      _map  rank_1  rank_2  map_winner
9          fnatic    BIG    Mirage       5      18           2
21         fnatic    BIG  Overpass       5      18           1
22  Natus Vincere  North      Nuke       1      23           2
23  Natus Vincere  North     Dust2       1      23           2
26         fnatic    BIG   Inferno       5      18           2

In [19]:
csgo_df.shape

(1632, 5)